Autodesk.Revit.DB.BuiltInFailures.SplineFailures.ClosedSpline
Closed or self-intersecting splines are not allowed.

Autodesk.Revit.DB.BuiltInFailures.SplineFailures.CannotCreateSpline
Can't make Spline.

Autodesk.Revit.DB.BuiltInFailures.SplineFailures
Failures about Spline.